class AdminInterfaceText:
    class Operator:
        ADD = "➕ Добавить оператора"
        REMOVE = "➖ Удалить оператора"
        LIST = "👥 Список операторов"
        BACK = "⬅️ Назад"

    class Question:
        ADD = "➕ Добавить вопрос"
        REMOVE = "➖ Удалить вопрос"
        EDIT = "✏️ Изменить вопрос"
        LIST = "👥 Список вопросов"
        BACK = "⬅️ Назад"

    class Admin:
        ADD = "➕ Добавить админа"
        REMOVE = "➖ Удалить админа"
        LIST = "👀 Список админов"
        BACK = "⬅️ Назад"

    class Direction:
        ADD = "➕ Добавить образовательную программу"
        REMOVE = "➖ Удалить образовательную программу"
        LIST = "👀 Список образовательных программ"
        BACK = "⬅️ Назад"

    class AdminMenu:
        CHANGE_GREETING = "✏️ Изменить приветствие"
        OPERATOR_PANEL = "👨💼 Управление операторами"
        ADMIN_PANEL = "👑 Управление админами"
        QUESTION_PANEL = "❓ Управление вопросами"
        DIRECTION_PANEL = "📊 Управление образовательными программами"
